; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared3 - mode
	image2 - mode
	image0 - mode
	thermograph1 - mode
	GroundStation1 - direction
	Star5 - direction
	Star7 - direction
	GroundStation10 - direction
	Star11 - direction
	Star4 - direction
	Star6 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	Star9 - direction
	Star8 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared3)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument2 image2)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
)
(:goal (and
	(pointing satellite0 Star11)
	(have_image Planet12 image0)
	(have_image Planet13 infrared3)
	(have_image Star14 thermograph1)
	(have_image Phenomenon15 thermograph1)
	(have_image Phenomenon16 image2)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 6
2. (calibrate satellite1 instrument2 star9)
   added: (calibrated instrument2)
   goals met: 0 of 6
3. (turn_to satellite1 phenomenon15 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 6
4. (turn_to satellite0 groundstation0 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 6
5. (take_image satellite1 phenomenon15 instrument2 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 1 of 6
6. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 6
7. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 1 of 6
8. (turn_to satellite0 phenomenon16 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 6
9. (take_image satellite0 phenomenon16 instrument1 image2)
   added: (have_image phenomenon16 image2)
   goals met: 2 of 6
10. (turn_to satellite0 planet13 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet13)
   goals met: 2 of 6
11. (take_image satellite0 planet13 instrument1 infrared3)
   added: (have_image planet13 infrared3)
   goals met: 3 of 6
12. (turn_to satellite0 star11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star11)
   goals met: 4 of 6
13. (turn_to satellite1 planet12 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 planet12)
   goals met: 4 of 6
14. (take_image satellite1 planet12 instrument2 image0)
   added: (have_image planet12 image0)
   goals met: 5 of 6
15. (turn_to satellite1 star14 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star14)
   goals met: 5 of 6
16. (take_image satellite1 star14 instrument2 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 6 of 6
